Revit 2024 API
ParameterTypeId.AnalyticalSurface Property
 "Analytical Surface"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalSurface { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalSurface As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalSurface {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace